# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [38]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [3]:
df.head()   # returns the first n rows of the df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [8]:
df['col2'].unique() # returns a numpy array of all the unique values from a particular column

array([444, 555, 666])

In [7]:
df['col2'].nunique() # returns the # of unique values from a particular column

3

In [13]:
df.iloc[2].unique() # eturns a numpy array of all the unique values from a particular row

array([3, 666, 'ghi'], dtype=object)

In [14]:
df.iloc[2].nunique()    # returns the # of unique values from a particular row

3

In [15]:
df['col2'].value_counts()   # Returns a pandas series with values from a column and the frequency of each value in the column.

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [17]:
# Select from a DataFrame using criteria from multiple columns
newdf = df[(df['col1']<2) & (df['col2']==444)]

In [18]:
newdf

   col1  col2 col3
0     1   444  abc

In [19]:
# Break down the above statement for multi-col filtering
col1_cond = df['col1'] < 2  # A series of boolean values for col2 based on if a value meets the criteria
col2_cond = df['col2'] == 444 # A series of boolean values for col2 based on if a value meets the criteria
filtered_df = df[col1_cond & col2_cond]
filtered_df

   col1  col2 col3
0     1   444  abc

### Applying Functions

In [20]:
df['col1'].sum() # Pandas allows applying built in methods to a df and /or series

10

In [22]:
df['col3'].apply(len) # Note to only include the function name, not to invoke it using ()

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [27]:
# We can also apply custom functions to pandas dfs and series e.g:
def times2(x):
    return x*2

In [28]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [29]:
# This application of custom functions becomes more powerful with lambda functions for one-time function use:
df['col1'].apply(lambda x: x*2) # Similar to above.

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

** Removing a Column **

In [44]:
df.drop(['col1'], axis=1) # Must sepcify axis=1 for columns, else default to rows as shown below

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [50]:
df.drop([0])

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [58]:
df # the above two are not inplace and do not permanently affect the original df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Permanently removing columns

In [59]:
df.drop(['col1'], axis=1, inplace=True) # Permanently removes a column or row

In [60]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [62]:
del df['col2']  # another way to permanently delete colums without specifiying the axis or inplace parameters.

In [63]:
df

  col3
0  abc
1  def
2  ghi
3  xyz

** Get column and row names/labels: **

In [66]:
df0 = pd.DataFrame(np.random.rand(6,3), index=['R1','R2','R3','R4','R5','R6'], columns=['C1','C2','C3'])
df0.index.names = ['ID']
df0

          C1        C2        C3
ID
R1  0.900004  0.535973  0.784527
R2  0.884707  0.874599  0.558497
R3  0.783618  0.686979  0.123426
R4  0.742726  0.440318  0.773810
R5  0.198821  0.564607  0.315786
R6  0.144574  0.380647  0.435681

In [67]:
r1 = df.columns  # returns an Index object which is list of the df column labels
r1

Index(['col1', 'col2', 'col3'], dtype='object')

In [68]:
r1.dtype # Index object

dtype('O')

In [69]:
r2 = df.index  # returns a range index object specifying rows range as int
r2

RangeIndex(start=0, stop=4, step=1)

In [70]:
r2.dtype # Range object

dtype('int64')

** Sorting and Ordering a DataFrame:**

In [71]:
df0

          C1        C2        C3
ID
R1  0.900004  0.535973  0.784527
R2  0.884707  0.874599  0.558497
R3  0.783618  0.686979  0.123426
R4  0.742726  0.440318  0.773810
R5  0.198821  0.564607  0.315786
R6  0.144574  0.380647  0.435681

In [72]:
df0.sort_values(by='C1') # inplace = False by default, ascending = True by default

          C1        C2        C3
ID
R6  0.144574  0.380647  0.435681
R5  0.198821  0.564607  0.315786
R4  0.742726  0.440318  0.773810
R3  0.783618  0.686979  0.123426
R2  0.884707  0.874599  0.558497
R1  0.900004  0.535973  0.784527

In [73]:
df0.sort_values(by='C1', ascending=False) # Descending order

          C1        C2        C3
ID
R1  0.900004  0.535973  0.784527
R2  0.884707  0.874599  0.558497
R3  0.783618  0.686979  0.123426
R4  0.742726  0.440318  0.773810
R5  0.198821  0.564607  0.315786
R6  0.144574  0.380647  0.435681

** Working with Null Values (NaN) **

In [76]:
df0.head(2)  # Fetch the first 2 rows

          C1        C2        C3
ID
R1  0.900004  0.535973  0.784527
R2  0.884707  0.874599  0.558497

In [81]:
df0.head() # max first 5 by default

          C1        C2        C3
ID
R1  0.900004  0.535973  0.784527
R2  0.884707  0.874599  0.558497
R3  0.783618  0.686979  0.123426
R4  0.742726  0.440318  0.773810
R5  0.198821  0.564607  0.315786

In [82]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [85]:
df.isnull() # if any of the values in df are NaN

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [87]:
# Drop rows with NaN Values
df.dropna() # Not inplace by default

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [88]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [119]:
df.fillna('FILL')   # Fill NaN with custom values

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

### Pivot Table in Pandas
#### Summarizes extensive data by combining required columns and rows and perfoming statistical operations such as sum etc.

In [89]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','z','y','x','z'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [90]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  z  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  z  1

In [96]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])  # Build summary report from df with rows from cols A & B, columsn from col C and values from col D. Default function 'mean' on the values.

C          x    y    z
A   B
bar one  4.0  NaN  1.0
    two  NaN  5.0  NaN
foo one  1.0  3.0  NaN
    two  NaN  NaN  2.0

In [97]:
df.pivot_table(values='D', index='B', columns='A', aggfunc=sum)

A    bar  foo
B
one    5    4
two    5    2

# Great Job!